In [1]:
import pandas as pd

In [2]:
df= pd.read_excel("Online Retail.xlsx")

In [3]:
df.shape

(541909, 8)

In [4]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [6]:
new_df = df[df['InvoiceNo']==536544].iloc[:,:4]

In [7]:
new_df

     InvoiceNo StockCode                      Description  Quantity
1443    536544     21773  DECORATIVE ROSE BATHROOM BOTTLE         1
1444    536544     21774  DECORATIVE CATS BATHROOM BOTTLE         2
1445    536544     21786               POLKADOT RAIN HAT          4
1446    536544     21787            RAIN PONCHO RETROSPOT         2
1447    536544     21790               VINTAGE SNAP CARDS         9
...        ...       ...                              ...       ...
1965    536544     21721        CANDY SHOP  STICKER SHEET         1
1966    536544     21722      SWEET PUDDING STICKER SHEET         1
1967    536544     21731    RED TOADSTOOL LED NIGHT LIGHT         5
1968    536544     21742      LARGE ROUND WICKER PLATTER          1
1969    536544     21758             VINTAGE SHELLS PRINT         1

[527 rows x 4 columns]

In [8]:
new_df2= df[['StockCode','UnitPrice']]

In [9]:
new_df2

       StockCode  UnitPrice
0         85123A       2.55
1          71053       3.39
2         84406B       2.75
3         84029G       3.39
4         84029E       3.39
...          ...        ...
541904     22613       0.85
541905     22899       2.10
541906     23254       4.15
541907     23255       4.15
541908     22138       4.95

[541909 rows x 2 columns]

In [10]:
vals= new_df2['UnitPrice']

In [11]:
vals.mean()

4.611113626083471

In [12]:
vals.std()

96.75985306119716

In [13]:
min(vals)

-11062.06

In [14]:
max(vals)

38970.0

In [15]:
vals.count()

541909

In [16]:
vals.median()

2.08

In [17]:
sum(vals)

2498803.9739972674

In [18]:
vals.var()

9362.469164424467

In [19]:
#skipping first 100 rows

In [20]:
new_df3= df.iloc[100:,:]

In [21]:
new_df3=new_df3.sort_values(by="InvoiceDate")

In [22]:
new_df3['Description'].unique()

array(['TOMATO CHARLIE+LOLA COASTER SET',
       'CHARLIE & LOLA WASTEPAPER BIN FLORA',
       'RED CHARLIE+LOLA PERSONAL DOORSIGN', ..., 'lost',
       'CREAM HANGING HEART T-LIGHT HOLDER',
       'PAPER CRAFT , LITTLE BIRDIE'], dtype=object)

In [28]:
a=[]
for i in new_df3['Description'].values:
    try:
        
        a.append(i[0]=='D')
    except:
        a.append('N.A')

In [30]:
new_df3['condt']=a

In [31]:
new_df3[new_df3['condt']==True]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,condt
140,536381,21523,DOORMAT FANCY FONT HOME SWEET HOME,10,2010-12-01 09:41:00,6.75,15311.0,United Kingdom,True
141,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527.0,United Kingdom,True
185,536388,21523,DOORMAT FANCY FONT HOME SWEET HOME,2,2010-12-01 09:59:00,7.95,16250.0,United Kingdom,True
228,536390,22654,DELUXE SEWING KIT,40,2010-12-01 10:19:00,4.95,17511.0,United Kingdom,True
219,536390,20668,DISCO BALL CHRISTMAS DECORATION,288,2010-12-01 10:19:00,0.10,17511.0,United Kingdom,True
...,...,...,...,...,...,...,...,...,...
541653,581538,23033,DRAWER KNOB CERAMIC RED,1,2011-12-09 11:34:00,1.45,14446.0,United Kingdom,True
541651,581538,23034,DRAWER KNOB CERAMIC BLACK,1,2011-12-09 11:34:00,1.45,14446.0,United Kingdom,True
541727,581570,23077,DOUGHNUT LIP GLOSS,20,2011-12-09 11:59:00,1.25,12662.0,Germany,True
541733,581571,48187,DOORMAT NEW ENGLAND,1,2011-12-09 12:00:00,8.25,15311.0,United Kingdom,True
541893,581586,20685,DOORMAT RED RETROSPOT,10,2011-12-09 12:49:00,7.08,13113.0,United Kingdom,True

In [33]:
#lists of lists
student=[['student name','date of birth','marks in maths'],
         ['Manav','03/09/2000',100],
        ['Raghav','02/08/2000',98],
        ['Mehek','21/07/1999',70],
        ['Mansi','10/07/2000',80],
        ['Harsh','15/06/2000',95]]
headers=student.pop(0)
studentdf=pd.DataFrame(student,columns=headers)
print(studentdf)
print(studentdf['marks in maths'].tolist())

  student name date of birth  marks in maths
0        Manav    03/09/2000             100
1       Raghav    02/08/2000              98
2        Mehek    21/07/1999              70
3        Mansi    10/07/2000              80
4        Harsh    15/06/2000              95
[100, 98, 70, 80, 95]

In [34]:
#dict of narray/lists
student1={'student name':['Manav','Raghav','Mehek','Mansi','Harsh'],
          'date of birth':['03/09/2000', '02/08/2000', '21/07/1999', '10/07/2000', '15/06/2000'],
          'marks in maths':[100, 98, 70, 80, 95]}
studentdf1=pd.DataFrame(student1)
print(studentdf1)

  student name date of birth  marks in maths
0        Manav    03/09/2000             100
1       Raghav    02/08/2000              98
2        Mehek    21/07/1999              70
3        Mansi    10/07/2000              80
4        Harsh    15/06/2000              95

In [36]:
#list of dicts
student2=[{'student name': 'Manav', 'date of birth': '03/09/2000', 'marks in maths': 100},
          {'student name': 'Raghav', 'date of birth': '02/08/2000', 'marks in maths': 98}, 
          {'student name': 'Mehek', 'date of birth': '21/07/1999', 'marks in maths': 70},
          {'student name': 'Mansi', 'date of birth': '10/07/2000', 'marks in maths': 80},
          {'student name': 'Harsh', 'date of birth': '15/06/2000', 'marks in maths': 95}]
studentdf2=pd.DataFrame(student2)
print(studentdf2)

  student name date of birth  marks in maths
0        Manav    03/09/2000             100
1       Raghav    02/08/2000              98
2        Mehek    21/07/1999              70
3        Mansi    10/07/2000              80
4        Harsh    15/06/2000              95

In [38]:
student3={'student name': pd.Series(['Manav','Raghav','Mehek','Mansi','Harsh']),
         'date of birth': pd.Series(['03/09/2000', '02/08/2000', '21/07/1999', '10/07/2000', '15/06/2000']),
         'marks in maths': pd.Series([100, 98, 70, 80, 95])}
studentdf3=pd.DataFrame(student3)
print(studentdf3)

  student name date of birth  marks in maths
0        Manav    03/09/2000             100
1       Raghav    02/08/2000              98
2        Mehek    21/07/1999              70
3        Mansi    10/07/2000              80
4        Harsh    15/06/2000              95

In [42]:
#empty dataframe
studentdf4=pd.DataFrame(columns=['student name','date of birth','marks in maths'])
print(studentdf4)

Empty DataFrame
Columns: [student name, date of birth, marks in maths]
Index: []

In [43]:
studentdf4=studentdf4.append({'student name' :'Manav', 
                             'date of birth': '03/09/2000', 'marks in maths': 100},ignore_index=True)
print(studentdf4)

  student name date of birth marks in maths
0        Manav    03/09/2000            100

In [44]:
studentdf4=studentdf4.append({'student name': 'Raghav', 'date of birth': '02/08/2000', 'marks in maths': 98},ignore_index=True)
print(studentdf4)

  student name date of birth marks in maths
0        Manav    03/09/2000            100
1       Raghav    02/08/2000             98

In [45]:
studentdf4=studentdf4.append({'student name': 'Mehek', 'date of birth': '21/07/1999', 'marks in maths': 70}
                            ,ignore_index=True)
print(studentdf4)

  student name date of birth marks in maths
0        Manav    03/09/2000            100
1       Raghav    02/08/2000             98
2        Mehek    21/07/1999             70

In [46]:
studentdf4=studentdf4.append({'student name': 'Mansi', 'date of birth': '10/07/2000', 'marks in maths': 80}
                            ,ignore_index=True)
print(studentdf4)

  student name date of birth marks in maths
0        Manav    03/09/2000            100
1       Raghav    02/08/2000             98
2        Mehek    21/07/1999             70
3        Mansi    10/07/2000             80

In [47]:
studentdf4=studentdf4.append({'student name': 'Harsh', 'date of birth': '15/06/2000', 'marks in maths': 95}
                            ,ignore_index=True)
print(studentdf4)

  student name date of birth marks in maths
0        Manav    03/09/2000            100
1       Raghav    02/08/2000             98
2        Mehek    21/07/1999             70
3        Mansi    10/07/2000             80
4        Harsh    15/06/2000             95

In [49]:
import numpy as np
n01=pd.Series(np.random.randn(100))
n02=pd.Series(np.random.randn(100))
add=n01+n02
sub=n01-n02
mult=n01*n02
div=n01/n02
print(pd.DataFrame({'number 1':n01,'number 2':n02,'add':add,'sub':sub,'mult':mult,'div':div}))

    number 1  number 2       add       sub      mult       div
0  -0.106477 -1.373543 -1.480020  1.267066  0.146251  0.077520
1   0.796568  1.070924  1.867493 -0.274356  0.853065  0.743814
2   0.247578  1.292974  1.540553 -1.045396  0.320112  0.191480
3   0.718105  1.586022  2.304127 -0.867917  1.138931  0.452771
4   1.226359 -1.062560  0.163800  2.288919 -1.303080 -1.154156
..       ...       ...       ...       ...       ...       ...
95  1.709321 -0.297641  1.411680  2.006962 -0.508764 -5.742894
96 -1.477968  0.354235 -1.123733 -1.832204 -0.523549 -4.172278
97  1.152009 -0.994802  0.157208  2.146811 -1.146021 -1.158029
98  1.617832  1.077881  2.695712  0.539951  1.743829  1.500938
99 -1.000973 -2.088190 -3.089163  1.087217  2.090222  0.479350

[100 rows x 6 columns]